---
kind: enumMember
id: F:Autodesk.Revit.DB.ConnectorType.Super
enum: Autodesk.Revit.DB.ConnectorType
source: html/769d8156-55b0-bda8-9e8f-f81fce49f1af.htm
---
# Autodesk.Revit.DB.ConnectorType.Super

Connection between a sub-system and a super-system, such as a connection between supply and return
 sub-systems and a main hydronic piping system or an air system.